In [5]:
using HTTP, SQLite

In [19]:
using DBInterface
using Statistics

In [6]:
url = "https://github.com/lerocha/chinook-database/raw/master/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite"
output_path = "Chinook_Sqlite.sqlite"

HTTP.download(url, output_path)

┌ Info: Downloading
│   source = "https://github.com/lerocha/chinook-database/raw/master/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite"
│   dest = "Chinook_Sqlite.sqlite"
│   progress = 1.0
│   time_taken = "0.13 s"
│   time_remaining = "0.0 s"
│   average_speed = "7.888 MiB/s"
│   downloaded = "1.018 MiB"
│   remaining = "0 bytes"
└   total = "1.018 MiB"

"Chinook_Sqlite.sqlite"

In [8]:
db = SQLite.DB(output_path)

SQLite.DB("Chinook_Sqlite.sqlite")

In [13]:
result = DBInterface.execute(db, "SELECT * FROM Album LIMIT 10;")

for row in result
    println(row)
end

SQLite.Row{false}:
 :AlbumId   1
 :Title      "For Those About To Rock We Salute You"
 :ArtistId  1
SQLite.Row{false}:
 :AlbumId   2
 :Title      "Balls to the Wall"
 :ArtistId  2
SQLite.Row{false}:
 :AlbumId   3
 :Title      "Restless and Wild"
 :ArtistId  2
SQLite.Row{false}:
 :AlbumId   4
 :Title      "Let There Be Rock"
 :ArtistId  1
SQLite.Row{false}:
 :AlbumId   5
 :Title      "Big Ones"
 :ArtistId  3
SQLite.Row{false}:
 :AlbumId   6
 :Title      "Jagged Little Pill"
 :ArtistId  4
SQLite.Row{false}:
 :AlbumId   7
 :Title      "Facelift"
 :ArtistId  5
SQLite.Row{false}:
 :AlbumId   8
 :Title      "Warner 25 Anos"
 :ArtistId  6
SQLite.Row{false}:
 :AlbumId   9
 :Title      "Plays Metallica By Four Cellos"
 :ArtistId  7
SQLite.Row{false}:
 :AlbumId   10
 :Title       "Audioslave"
 :ArtistId   8

In [14]:
using DataFrames

result = DBInterface.execute(db, "SELECT * FROM Album LIMIT 10;")
df = DataFrame(result)

10×3 DataFrame
 Row │ AlbumId  Title                              ArtistId
     │ Int64    String                             Int64
─────┼──────────────────────────────────────────────────────
   1 │       1  For Those About To Rock We Salut…         1
   2 │       2  Balls to the Wall                         2
   3 │       3  Restless and Wild                         2
   4 │       4  Let There Be Rock                         1
   5 │       5  Big Ones                                  3
   6 │       6  Jagged Little Pill                        4
   7 │       7  Facelift                                  5
   8 │       8  Warner 25 Anos                            6
   9 │       9  Plays Metallica By Four Cellos            7
  10 │      10  Audioslave                                8

In [15]:
query = """
SELECT 
    Album.AlbumId, 
    Album.Title AS AlbumTitle, 
    Artist.Name AS ArtistName, 
    SUM(InvoiceLine.UnitPrice * InvoiceLine.Quantity) AS TotalSales
FROM 
    Album
JOIN 
    Artist ON Album.ArtistId = Artist.ArtistId
JOIN 
    Track ON Album.AlbumId = Track.AlbumId
JOIN 
    InvoiceLine ON Track.TrackId = InvoiceLine.TrackId
GROUP BY 
    Album.AlbumId, Album.Title, Artist.Name
ORDER BY 
    TotalSales DESC
LIMIT 5;
"""

"SELECT \n    Album.AlbumId, \n    Album.Title AS AlbumTitle, \n    Artist.Name AS ArtistName, \n    SUM(InvoiceLine.UnitPrice * InvoiceLine.Quantity) AS TotalSales\nFROM \n    Album\nJOIN \n    Artist ON Album.ArtistId = Artist.ArtistId\nJOIN \n    Track ON Album.AlbumId = Track.AlbumId\nJOIN \n    InvoiceLine ON Track.TrackId = InvoiceLine.TrackId\nGROUP BY \n    Album.AlbumId, Album.Title, Artist.Name\nORDER BY \n    TotalSales DESC\nLIMIT 5;\n"

In [16]:
result = DBInterface.execute(db, query)
df = DataFrame(result)
display(df)

5×4 DataFrame
 Row │ AlbumId  AlbumTitle                         ArtistName                  ⋯
     │ Int64    String                             String                      ⋯
─────┼──────────────────────────────────────────────────────────────────────────
   1 │     253  Battlestar Galactica (Classic), …  Battlestar Galactica (Class ⋯
   2 │     251  The Office, Season 3               The Office
   3 │      23  Minha Historia                     Chico Buarque
   4 │     228  Heroes, Season 1                   Heroes
   5 │     231  Lost, Season 2                     Lost                        ⋯
                                                               2 columns omitted

In [17]:
query = """
SELECT Genre.Name, SUM(InvoiceLine.Quantity) AS TotalQuantity
FROM Genre
JOIN Track ON Genre.GenreId = Track.GenreId
JOIN InvoiceLine ON Track.TrackId = InvoiceLine.TrackId
GROUP BY Genre.Name
ORDER BY TotalQuantity DESC
LIMIT 1;
"""

"SELECT Genre.Name, SUM(InvoiceLine.Quantity) AS TotalQuantity\nFROM Genre\nJOIN Track ON Genre.GenreId = Track.GenreId\nJOIN InvoiceLine ON Track.TrackId = InvoiceLine.TrackId\nGROUP BY Genre.Name\nORDER BY TotalQuantity DESC\nLIMIT 1;\n"

In [18]:
result = DBInterface.execute(db, query)
df = DataFrame(result)

println("Top Selling Genre:")
display(df)

Top Selling Genre:

1×2 DataFrame
 Row │ Name    TotalQuantity
     │ String  Int64
─────┼───────────────────────
   1 │ Rock              835

In [20]:

query = """
SELECT 
    Customer.Country, 
    COUNT(DISTINCT Customer.CustomerId) AS TotalCustomers, 
    SUM(Invoice.Total) AS TotalSales
FROM 
    Customer
JOIN 
    Invoice ON Customer.CustomerId = Invoice.CustomerId
GROUP BY 
    Customer.Country
ORDER BY 
    TotalSales DESC;
"""

"SELECT \n    Customer.Country, \n    COUNT(DISTINCT Customer.CustomerId) AS TotalCustomers, \n    SUM(Invoice.Total) AS TotalSales\nFROM \n    Customer\nJOIN \n    Invoice ON Customer.CustomerId = Invoice.CustomerId\nGROUP BY \n    Customer.Country\nORDER BY \n    TotalSales DESC;\n"

In [21]:
result = DBInterface.execute(db, query)
df = DataFrame(result)


println("Sales Data Grouped by Country:")
display(df)

Sales Data Grouped by Country:

24×3 DataFrame
 Row │ Country         TotalCustomers  TotalSales
     │ String          Int64           Float64
─────┼────────────────────────────────────────────
   1 │ USA                         13      523.06
   2 │ Canada                       8      303.96
   3 │ France                       5      195.1
   4 │ Brazil                       5      190.1
   5 │ Germany                      4      156.48
   6 │ United Kingdom               3      112.86
   7 │ Czech Republic               2       90.24
   8 │ Portugal                     2       77.24
   9 │ India                        2       75.26
  10 │ Chile                        1       46.62
  11 │ Ireland                      1       45.62
  ⋮  │       ⋮               ⋮             ⋮
  15 │ Netherlands                  1       40.62
  16 │ Norway                       1       39.62
  17 │ Sweden                       1       38.62
  18 │ Spain                        1       37.62
  19 │ Poland                       1       37.62
  20 │ Italy                        1       37.62
  21 │ Denmark                      1       37.62
  22 │ Belgium                      1       37.62
  23 │ Australia                    1       37.62
  24 │ Argentina                    1       37.62
                                    3 rows omitted